/*
Problem-03: BCS Final Score Calculator
⚠️ Function Name Must be finalScore()
BCS পরীক্ষার OMR sheet ডিজিটালভাবে চেক করা হয়। এটা right, wrong, missed সব কটি গণনা করতে পারে, কিন্তু ফাইনাল স্কোর বের করতে পারে না। তোমার কাজ হলো একটি ফাংশন বানানো যা Object নেবে এবং ফাইনাল স্কোর ক্যালকুলেট করবে।
ফাংশনের কাজ: ফাংশনটি ইনপুট হিসেবে একটি Object নেবে এবং নিচের শর্ত ও নিয়ম অনুযায়ী ফলাফল প্রদান করবে।
📥 Input:
একটি Object যার প্রপার্টিগুলো হবে: { right: Number, wrong: Number, skip: Number }



Output :  ফাইনাল স্কোর হবে নাম্বার এবং রাউন্ডেড। (Number, Rounded)  


🎯 BCS পরীক্ষার নিয়ম:
মোট প্রশ্ন সংখ্যা = ১০০টি।
সুতরাং, ইনপুটে থাকা right + wrong + skip এর যোগফল অবশ্যই ১০০ হতে হবে।


🚩 Challenge:
যদি right + wrong + skip এর যোগফল ১০০ না হয়, তবে আউটপুট হিসেবে Invalid রিটার্ন করতে হবে।
*/

function finalScore(omr){

    if (omr.right + omr.wrong + omr.skip !== 100 || omr.right < 0 || omr.wrong < 0 || omr.skip < 0) return "Invalid";

    let score = omr.right * 1 - omr.wrong * 0.5;
    return Math.round(score);
}


// console.log(NaN <= 0 ? true : false);
// console.log(100-NaN);
// console.log(finalScore({ right: 67, wrong: 23, skip: 10 }));
// console.log(finalScore({ right: 80, wrong: 25, skip: 0 }));
// console.log(finalScore({ right: 50, wrong: 10, skip: 40 }));
// console.log(finalScore({ right: 30, wrong: 30, skip: 40 }));
// console.log(finalScore({ right: 30, wrong: -10, skip: 80 }));
// console.log(finalScore({ right: 70, wrong: 30, skip: "50" }));
// console.log(finalScore({ right: 100, wrong: 0, skip: NaN }));