/*
Problem-04: Upcoming Gono Vote
⚠️ Function Name Must be gonoVote()
আসন্ন গণভোটের ফলাফল বিশ্লেষণের জন্য তোমাকে একটি দায়িত্ব দেওয়া হয়েছে। ভোটের ডাটাগুলো একটি Array-তে জমা করা হয়েছে যেখানে ভোটারদের মতামত "ha" অথবা "na" হিসেবে আছে। তোমার কাজ হলো একটি ফাংশন তৈরি করা যা ভোট গণনা করবে এবং দেখবে "ha" ভোট সংখ্যাগরিষ্ঠ (Majority) কি না।
ফাংশনের কাজ: ফাংশনটি ইনপুট হিসেবে একটি Array নেবে এবং ভোটের সংখ্যার ওপর ভিত্তি করে একটি Boolean (true/false) অথবা equal (string) রিটার্ন করবে।
📥 Input:
ইনপুট হবে একটি Array। যেমন: ["ha", "na", "ha"]


🚀 Output:
যদি "ha" সংখ্যা "na" এর বেশি → true
যদি "ha" সংখ্যা "na" এর সমান → “equal”
অন্যথায় → false


🚩 Challenge:
যদি ইনপুটটি একটি Array না হয় (যেমন: String, Number বা Object), তবে আউটপুট হিসেবে Invalid রিটার্ন করতে হবে।
*/

function gonoVote(array){
    let countY = 0, countN = 0;
    if (!(array instanceof Array)) return "Invalid";

    for (voterOpinion of array){
        if(voterOpinion == "ha") countY += 1;
        if(voterOpinion == "na") countN += 1;
    }

    // for (let i = 0; i < array.length; i++){
    //     if(array[i] === "ha") countY += 1;
    //     if(array[i] === "na") countN += 1;
    // }

    if (countN == countY) {return "equal"}
    else if (countN < countY) {return true}
    else return false;
}

// console.log(gonoVote(["ha", "na", "ha", "na"]));
// console.log(gonoVote(["ha", "na", "na"]));
// console.log(gonoVote(["ha", "ha", "ha", "na"]));
// console.log(gonoVote("ha, na"));
// console.log(gonoVote(12345));